import { IImage } from './ImageBox.interface'

export const images: IImage[] = [
  {
    id: '0',
    author: {
      authorID: '0',
      name: 'Даниэль',
      surname: 'Герхартц',
    },
    src: 'https://iili.io/JvLpYzb.md.png',
    title: 'Зимнее солнце',
  },
  {
    id: '1',
    author: {
      authorID: '1',
      name: 'Джон',
      surname: 'Пойнтер',
    },
    src: 'https://iili.io/JvLpud7.jpg',
    title: 'Уголок виллы',
    description:
      'Интерьер древнеримской виллы, мраморные колонны, фонтаны, элементы декора, монументальная живопись',
  },
  {
    id: '2',
    author: {
      authorID: '2',
      name: 'Каспар Давид',
      surname: 'Фридрих',
    },
    src: 'https://iili.io/JvLpz12.jpg',
    title: 'Двое мужчин созерцая Луну',
    description:
      'Двое мужчин, созерцающих Луну, и Мужчина и женщина, созерцающие Луну, представляют собой серию похожих картин Каспара Давида Фридриха, обстановка которых является одной из его самых известных работ. Фридрих написал по меньшей мере три версии, в одной из которых изображены мужчина и женщина. Считается, что оригиналом является версия 1819-20 годов в галерее Neue Meister; вариант 1824 года с женщиной находится в Старой национальной галерее; а версия 1830 года находится в Музее искусств Метрополитен.',
  },
  {
    id: '3',
    author: {
      authorID: '3',
      name: 'Пьер Андре',
      surname: 'Бруйе',
    },
    src: 'https://iili.io/JvLpRee.jpg',
    title: 'Женщина у зеркала',
    description: 'Xолст, масло. 81 х 65.5 см',
  },
  {
    id: '4',
    author: {
      authorID: '4',
      name: 'Автор',
      surname: 'неизвестен',
    },
    src: 'https://iili.io/JvLpfbs.jpg',
    title: 'Горгона Медуза',
  },
  {
    id: '5',
    author: {
      authorID: '5',
      name: 'Андрей',
      surname: 'Шатилов',
    },
    src: 'https://iili.io/JvLpxql.jpg',
    title: 'Московская молитва',
  },
  {
    id: '6',
    author: {
      authorID: '6',
      name: 'Ян',
      surname: 'Вермеер',
    },
    src: 'https://iili.io/JvLp5mu.jpg',
    title: 'Женщина, держащая весы',
  },
  {
    id: '7',
    author: {
      authorID: '7',
      name: 'Петер Николай',
      surname: 'Арбо',
    },
    src: 'https://iili.io/JvLpA79.jpg',
    title: 'Дикая охота Одина',
  },
  {
    id: '8',
    author: {
      authorID: '8',
      name: 'Альбрехт',
      surname: 'Дюрер',
    },
    src: 'https://iili.io/JvLpCXf.jpg',
    title: 'Рыцарь, смерть и дьявол',
    description:
      'Резцовая гравюра на меди, созданная выдающимся художником Северного Возрождения Альбрехтом Дюрером в 1513 году. Как и гравюра «Меланхолия», это одно из наиболее таинственных произведений Дюрера, которое выделяется сложностью иконографии, неоднозначностью символов и аллегорий. Это первая из трёх так называемых «Мастерских гравюр» Альбрехта Дюрера: «Рыцарь, смерть и дьявол», «Святой Иероним в келье», «Меланхолия I». Гравюра создана в Нюрнберге после второй поездки художника в Италию в 1505-1506 годах, в период зрелости индивидуального стиля, наивысшего мастерства и устремления к философскому осмыслению действительности. Её размеры совсем невелики: 24,5 × 19,1 см.',
  },
  {
    id: '9',
    author: {
      authorID: '9',
      name: 'Максимилиан',
      surname: 'Ленц',
    },
    src: 'https://iili.io/JvLpns4.jpg',
    title: 'Мир',
    description:
      'Австрийский живописец, график и скульптор. Ленц был одним из основателей Венского сецессиона. В наиболее значимый периода творчества придерживался символизма, однако в поздний период обратился к реализму. Работал в различных техниках, включая масло, акварель, литографию и металлические рельефы.',
  },
]
